Please use the latest version [v2.8.0](https://github.com/kreuzwerker/terraform-provider-docker/releases/tag/v2.8.0).
The problem doesn't occur.

main.tf

```hcl
resource "docker_image" "app" {
  name = "appondocker"
  build {
    path = "."
  }
}
```

versions.tf

```hcl
terraform {
  required_providers {
    docker = {
      source = "kreuzwerker/docker"
    }
  }
  required_version = ">= 0.13"
}
```

```
$ terraform version
Terraform v0.13.5
+ provider registry.terraform.io/kreuzwerker/docker v2.8.0

$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_image.app will be created
  + resource "docker_image" "app" {
      + id     = (known after apply)
      + latest = (known after apply)
      + name   = "appondocker"
      + output = (known after apply)

      + build {
          + dockerfile = "Dockerfile"
          + path       = "."
          + remove     = true
          + tag        = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```